backend/app/controllers/api/v1/students_controller.rb

INSERT INTO `students` (`student_id`, `english_name`, `urdu_name`, `date_of_birth`, `contact_number`, `fathers_english_name`, `fathers_urdu_name`, `guardians_id`, `current_address`, `permanent_address`, `previous_institute`, `previous_education`, `school_education`, `admission_type`, `admission_date`, `admission_evaluator`, `admission_notes`, `evaluator_recommendation`, `created_at`, `updated_at`) VALUES ('FO50212', 'Rayyan Nadeem', 'اشعر ندیم', '2020-12-22 00:00:00', '4435839571', 'Muhammad Nadeem', 'محمد ندیم', '123456789', '8337 Governor Run, Ellicott City MD 21043', '8337 Governor Run, Ellicott City MD 21043', 'Masjid Fatima', 'Completed Quran', 'University', 'Quran', '2020-12-22', 'Muhammad Nadeem', 'Starting daily classes', 'Adult Class', '2020-12-22 22:38:37.369635', '2020-12-22 22:38:37.369635')
---
    def create
        @student = Student.new(student_params)
        if @student.save

SELECT `students`.* FROM `students` WHERE (FO50212) LIMIT 1
---
    def find_student
        @student = Student.find_by(params[:student_id])